#pragma once

/********************************************************************
	Created:		2019-04-08
	Author:			xuduo;
	Version:		1.0.0(version);
	Description:	对原生mutex封装，支持自动锁功能;
----------------------------------------------------------------------------

----------------------------------------------------------------------------
  Remark         :
----------------------------------------------------------------------------
  Change History :
  <Date>     | <Version> | <Author>       | <Description>
----------------------------------------------------------------------------
  2019-04-08 |	1.0.0	 |	xuduo		  | Create file
----------------------------------------------------------------------------
*********************************************************************/

#include "lock_base.h"
#include <mutex>

class Mutex : public LockBase
{
public:
	Mutex();
	virtual ~Mutex();

	virtual void Lock() override;
	virtual void Unlock() override;

private:
	std::mutex _mutex;
};